mysql> select * from emp where dept_id in (select id from dept where name = '销售部' or name = ' 市场部');
+----+-----------+------+-----------------+--------+------------+-----------+---------+
| id | name      | age  | job             | salary | entrydate  | managerid | dept_id |
+----+-----------+------+-----------------+--------+------------+-----------+---------+
| 10 | 赵敏      |   20 | 市场部总监      |  12500 | 2004-10-12 |         1 |       2 |
| 11 | 鹿杖客    |   56 | 职员            |   3750 | 2006-10-03 |        10 |       2 |
| 12 | 鹤笔翁    |   19 | 职员            |   3750 | 2007-05-09 |        10 |       2 |
| 13 | 方东白    |   19 | 职员            |   5500 | 2009-02-12 |        10 |       2 |
| 14 | 张三丰    |   88 | 销售总监        |  14000 | 2004-10-12 |         1 |       4 |
| 15 | 俞莲舟    |   38 | 销售            |   4600 | 2004-10-12 |        14 |       4 |
| 16 | 宋远桥    |   40 | 销售            |   4600 | 2004-10-12 |        14 |       4 |
+----+-----------+------+-----------------+--------+------------+-----------+---------+
7 rows in set (0.00 sec)

mysql>
mysql> select * from emp where salary > all ( select salary from emp where dept_id = (select id from dept where name = '财务部'));
Empty set (0.00 sec)

mysql> select * from emp where salary > any ( select salary from emp where dept_id = (select id from dept where name = '研发部') );
+----+-----------+------+-----------------+--------+------------+-----------+---------+
| id | name      | age  | job             | salary | entrydate  | managerid | dept_id |
+----+-----------+------+-----------------+--------+------------+-----------+---------+
|  1 | 金庸      |   66 | 总裁            |  20000 | 2000-01-01 |      NULL |       5 |
|  2 | 张无忌    |   20 | 项目经理        |  12500 | 2005-12-05 |         1 |       1 |
|  3 | 杨逍      |   33 | 开发            |   8400 | 2000-11-03 |         2 |       1 |
|  4 | 韦一笑    |   48 | 开发            |  11000 | 2002-02-05 |         2 |       1 |
|  5 | 常遇春    |   43 | 开发            |  10500 | 2004-09-07 |         3 |       1 |
|  7 | 灭绝      |   60 | 财务总监        |   8500 | 2002-09-12 |         1 |       3 |
|  8 | 周芷若    |   19 | 会计            |  48000 | 2006-06-02 |         7 |       3 |
| 10 | 赵敏      |   20 | 市场部总监      |  12500 | 2004-10-12 |         1 |       2 |
| 14 | 张三丰    |   88 | 销售总监        |  14000 | 2004-10-12 |         1 |       4 |
+----+-----------+------+-----------------+--------+------------+-----------+---------+
9 rows in set (0.00 sec)
