-- A. 查询指定字段 name, workno, age并返回
       select name,workno,age from emp;
-- B. 查询返回所有字段
       select id ,workno,name,gender,age,idcard,workaddress,entrydate from emp;
       select * from emp;
-- C. 查询所有员工的工作地址,起别名
       select workaddress as '工作地址' from emp;
--     -- as可以省略
       select workaddress '工作地址' from emp;
-- D. 查询公司员工的上班地址有哪些(不要重复)
       select distinct workaddress '工作地址' from emp;

mysql> select name,workno,age from emp;
+-----------+--------+------+
| name      | workno | age  |
+-----------+--------+------+
| 柳岩    | 00001  |   20 |
| 张无忌 | 00002  |   18 |
| 韦一笑 | 00003  |   38 |
| 赵敏    | 00004  |   18 |
| 小昭    | 00005  |   16 |
| 杨逍    | 00006  |   28 |
| 范瑶    | 00007  |   40 |
| 黛绮丝 | 00008  |   38 |
| 范凉凉 | 00009  |   45 |
| 陈友谅 | 00010  |   53 |
| 张士诚 | 00011  |   55 |
| 常遇春 | 00012  |   32 |
| 张三丰 | 00013  |   88 |
| 灭绝    | 00014  |   65 |
| 胡青牛 | 00015  |   70 |
| 周芷若 | 00016  |   18 |
+-----------+--------+------+

mysql> select * from emp;
+------+--------+-----------+--------+------+--------------------+-------------+------------+
| id   | workno | name      | gender | age  | idcard             | workaddress | entrydate  |
+------+--------+-----------+--------+------+--------------------+-------------+------------+
|    1 | 00001  | 柳岩    | 女    |   20 | 123456789012345678 | 北京      | 2000-01-01 |
|    2 | 00002  | 张无忌 | 男    |   18 | 123456789012345670 | 北京      | 2005-09-01 |
|    3 | 00003  | 韦一笑 | 男    |   38 | 123456789712345670 | 上海      | 2005-08-01 |
|    4 | 00004  | 赵敏    | 女    |   18 | 123456757123845670 | 北京      | 2009-12-01 |
|    5 | 00005  | 小昭    | 女    |   16 | 123456769012345678 | 上海      | 2007-07-01 |
|    6 | 00006  | 杨逍    | 男    |   28 | 12345678931234567X | 北京      | 2006-01-01 |
|    7 | 00007  | 范瑶    | 男    |   40 | 123456789212345670 | 北京      | 2005-05-01 |
|    8 | 00008  | 黛绮丝 | 女    |   38 | 123456157123645670 | 天津      | 2015-05-01 |
|    9 | 00009  | 范凉凉 | 女    |   45 | 123156789012345678 | 北京      | 2010-04-01 |
|   10 | 00010  | 陈友谅 | 男    |   53 | 123456789012345670 | 上海      | 2011-01-01 |
|   11 | 00011  | 张士诚 | 男    |   55 | 123567897123465670 | 江苏      | 2015-05-01 |
|   12 | 00012  | 常遇春 | 男    |   32 | 123446757152345670 | 北京      | 2004-02-01 |
|   13 | 00013  | 张三丰 | 男    |   88 | 123656789012345678 | 江苏      | 2020-11-01 |
|   14 | 00014  | 灭绝    | 女    |   65 | 123456719012345670 | 西安      | 2019-05-01 |
|   15 | 00015  | 胡青牛 | 男    |   70 | 12345674971234567X | 西安      | 2018-04-01 |
|   16 | 00016  | 周芷若 | 女    |   18 | NULL               | 北京      | 2012-06-01 |
+------+--------+-----------+--------+------+--------------------+-------------+------------+
16 rows in set (0.00 sec)

mysql> select workaddress as '工作地址' from emp;
+--------+
| 工作地址|
+--------+
| 北京 |
| 北京 |
| 上海 |
| 北京 |
| 上海 |
| 北京 |
| 北京 |
| 天津 |
| 北京 |
| 上海 |
| 江苏 |
| 北京 |
| 江苏 |
| 西安 |
| 西安 |
| 北京 |
+--------+
16 rows in set (0.00 sec)

mysql> select distinct workaddress '工作地址' from emp;
+--------+
| 工作地址|
+--------+
| 北京 |
| 上海 |
| 天津 |
| 江苏 |
| 西安 |
+--------+
5 rows in set (0.00 sec)

