-- A. ceil：向上取整
	select ceil(1.1);
-- B. floor：向下取整
	select floor(1.9);
-- C. mod：取模
	select mod(7,4);
-- D. rand：获取随机数
	select rand();
-- E. round：四舍五入
	select round(2.344,2);
-- F. 通过数据库的函数，生成一个六位数的随机验证码。
-- 	思路： 获取随机数可以通过rand()函数，但是获取出来的随机数是在0-1之间的，所以可以在其基础上乘以1000000，然后舍弃小数部分，如果长度不足6位，补0
	select lpad(round(rand()*1000000 , 0), 6, '0');
	
	
mysql> select ceil(1.1);
+-----------+
| ceil(1.1) |
+-----------+
|         2 |
+-----------+
1 row in set (0.00 sec)

mysql> select floor(1.9);
+------------+
| floor(1.9) |
+------------+
|          1 |
+------------+
1 row in set (0.00 sec)

mysql> select mod(7,4);
+----------+
| mod(7,4) |
+----------+
|        3 |
+----------+
1 row in set (0.00 sec)

mysql> select rand();
+--------------------+
| rand()             |
+--------------------+
| 0.9710186402974824 |
+--------------------+
1 row in set (0.00 sec)

mysql> select round(2.344,2);
+----------------+
| round(2.344,2) |
+----------------+
|           2.34 |
+----------------+
1 row in set (0.00 sec)

mysql> select lpad(round(rand()*1000000 , 0), 6, '0');
+-----------------------------------------+
| lpad(round(rand()*1000000 , 0), 6, '0') |
+-----------------------------------------+
| 657867                                  |
+-----------------------------------------+
1 row in set (0.00 sec)
