mysql> select e.name, d.name from emp e inner join dept d on e.dept_id = d.id;
+-----------+-----------+
| name      | name      |
+-----------+-----------+
| 张无忌    | 研发部    |
| 杨逍      | 研发部    |
| 韦一笑    | 研发部    |
| 常遇春    | 研发部    |
| 小昭      | 研发部    |
| 赵敏      | 市场部    |
| 鹿杖客    | 市场部    |
| 鹤笔翁    | 市场部    |
| 方东白    | 市场部    |
| 灭绝      | 财务部    |
| 周芷若    | 财务部    |
| 丁敏君    | 财务部    |
| 张三丰    | 销售部    |
| 俞莲舟    | 销售部    |
| 宋远桥    | 销售部    |
| 金庸      | 总经办    |
+-----------+-----------+
16 rows in set (0.00 sec)
